const timelineData = [
    {
        startYear: 2000,
        endYear: 2005,
        title: 'Наука',
        events: [
            { year: 2000, description: 'Запуск первого спутника на орбиту' },
            { year: 2001, description: 'Создание популярной операционной системы' },
            { year: 2002, description: 'Изобретение портативного медиаплеера' },
            { year: 2004, description: 'Открытие нового источника энергии' },
            { year: 2005, description: 'Запуск первой версии популярной соцсети' },
        ],
    },
    {
        startYear: 2006,
        endYear: 2010,
        title: 'Литература',

        events: [
            { year: 2006, description: 'Начало массового использования смартфонов' },
            { year: 2007, description: 'Изобретение технологии облачных вычислений' },
            { year: 2008, description: 'Создание популярной платформы для потокового видео' },
            { year: 2009, description: 'Прорыв в исследовании искусственного интеллекта' },
            { year: 2010, description: 'Запуск программы освоения Луны' },
        ],
    },
    {
        startYear: 2011,
        endYear: 2015,
        title: 'Музыка',

        events: [
            { year: 2011, description: 'Открытие первого частного космического корабля' },
            { year: 2012, description: 'Появление первой коммерческой электростанции на солнечной энергии' },
            { year: 2013, description: 'Запуск первого беспилотного автомобиля' },
            { year: 2014, description: 'Создание самого мощного суперкомпьютера' },
            { year: 2015, description: 'Введение стандарта 4G в большинстве стран мира' },
        ],
    },
    {
        startYear: 2016,
        endYear: 2020,
        title: 'Археология',

        events: [
            { year: 2016, description: 'Появление новых технологий дополненной реальности' },
            { year: 2017, description: 'Запуск массового производства автономных дронов' },
            { year: 2018, description: 'Открытие экзопланеты, пригодной для жизни' },
            { year: 2019, description: 'Создание первого квантового компьютера' },
            { year: 2020, description: 'Разработка вакцины от глобальной пандемии' },
        ],
    },
    {
        startYear: 2021,
        endYear: 2025,
        title: 'Психология',

        events: [
            { year: 2021, description: 'Запуск пятого поколения сетей связи (5G)' },
            { year: 2022, description: 'Создание сверхскоростного вакуумного поезда' },
            { year: 2023, description: 'Открытие альтернативного метода хранения энергии' },
            { year: 2024, description: 'Первые успешные эксперименты с генной терапией' },
            { year: 2025, description: 'Массовое использование летающих автомобилей' },
        ],
    },
    {
        startYear: 2026,
        endYear: 2030,
        title: 'Саморазвитие',

        events: [
            { year: 2026, description: 'Открытие новой частицы в физике' },
            { year: 2027, description: 'Создание первой базы на Луне' },
            { year: 2028, description: 'Массовое использование водородного топлива' },
            { year: 2029, description: 'Появление полноценных искусственных органов' },
            { year: 2030, description: 'Достижение первого этапа колонизации Марса' },
        ],
    },
];

export default timelineData;
